Delans-TLE/src/Documents/ES_УстановкаЦенДоставки/ES_УстановкаЦенДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ES_УстановкаЦенДоставки</name>
  <registerRecords>InformationRegister.ES_ЦеныДоставкиДопУслуги</registerRecords>
  <registerRecords>InformationRegister.ES_ЦеныДоставки</registerRecords>
  <attributes>
    <name>Тариф</name>
    <type>
      <types>EnumRef.ES_СрочностьДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоставки</name>
    <type>
      <types>EnumRef.ES_ВидыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонтрагента</name>
    <type>
      <types>EnumRef.ES_ВидКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Цены</name>
    <attributes>
      <name>Вес</name>
      <type>
        <types>CatalogRef.ES_Вес</types>
      </type>
    </attributes>
    <attributes>
      <name>ДДСтоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДДСрок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СДСтоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СДСрок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ССтоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ССрок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗонаДоставки</name>
      <type>
        <types>CatalogRef.ES_ЗоныДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДопУслуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаЗаКаждыйКг</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Delans-TLE/src/InformationRegisters/ES_ЦеныДоставки/ES_ЦеныДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ES_ЦеныДоставки</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДДСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДДСрок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СДСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СДСрок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ССтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ССрок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗаКаждый</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИнтервалЗаКаждый</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Зона</name>
    <type>
      <types>CatalogRef.ES_ЗоныДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вес</name>
    <type>
      <types>CatalogRef.ES_Вес</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тариф</name>
    <type>
      <types>EnumRef.ES_СрочностьДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДоставки</name>
    <type>
      <types>EnumRef.ES_ВидыДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидКонтрагента</name>
    <type>
      <types>EnumRef.ES_ВидКонтрагента</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Delans-TLE/src/InformationRegisters/ES_ЦеныДоставкиДопУслуги/ES_ЦеныДоставкиДопУслуги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ES_ЦеныДоставкиДопУслуги</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаЗаКаждыйКилограмм</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Delans-TLE/src/Documents/ES_УстановкаЦенДоставки/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если НЕ Договор.Пустая() И НЕ Договор.ES_УчетПриРасчетеЦенТК Тогда
		Сообщить("Для договора "+Договор+" не установлен признак индивидуальных цен.",СтатусСообщения.ОченьВажное);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	   //Сережко АС +
	// регистр ES_ЦеныДоставки
	Движения.ES_ЦеныДоставки.Записывать = Истина;
	Для Каждого ТекСтрокаЦены Из Цены Цикл
		Движение = Движения.ES_ЦеныДоставки.Добавить();
		Движение.Период = Дата;
		Движение.Зона = ТекСтрокаЦены.ЗонаДоставки;
		Движение.Тариф = Тариф;
		Движение.Вес = ТекСтрокаЦены.Вес;
		Движение.Цена = ТекСтрокаЦены.Цена;
		Движение.Договор = Договор;
		Движение.ВидДоставки = ВидДоставки;	
		Движение.ВидКонтрагента = ВидКонтрагента;
		Движение.ВесОт = ТекСтрокаЦены.Вес.ВесОт;
		Движение.ВесДо = ТекСтрокаЦены.Вес.ВесДо;
		Движение.ЗаКаждый = ТекСтрокаЦены.Вес.ЗаКаждые;
		Движение.ИнтервалЗаКаждый = ТекСтрокаЦены.Вес.Интервал;
	КонецЦикла;
	
	Движения.ES_ЦеныДоставкиДопУслуги.Записывать = Истина;
	Для Каждого ТекСтрокаДопУслуги Из ДопУслуги Цикл    
		Движение = Движения.ES_ЦеныДоставкиДопУслуги.Добавить(); 
		Движение.Договор = Договор;    
		Движение.Номенклатура = ТекСтрокаДопУслуги.Номенклатура;
		Движение.ЦенаЗаКаждыйКилограмм = ТекСтрокаДопУслуги.ЦенаЗаКаждыйКг;
		Движение.Цена = ТекСтрокаДопУслуги.Цена;
		Движение.Период = Дата;
	КонецЦикла;        	
	
	  //Сережко АС -

КонецПроцедуры
